simpleClient/readme.md
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">simple client</a>
<ul>
<li><a href="#sec-1-1">install</a></li>
<li><a href="#sec-1-2">running simple client</a></li>
<li><a href="#sec-1-3">configuration</a></li>
</ul>
</li>
</ul>
</div>
</div>

# simple client<a id="sec-1" name="sec-1"></a>

Simple client is a simple wxPython GUI program that reads from the serial
port from a thread, checks access, and updates the GUI with the status of
the access lookup.

## install<a id="sec-1-1" name="sec-1-1"></a>

-   download and install wxPython: <http://www.wxpython.org/download.php>
-   pip install requests
-   pip install pyserial

## running simple client<a id="sec-1-2" name="sec-1-2"></a>

-   start->run: cmd
-   cd \\
-   cd data
-   cd simpleAccess
-   cd simpleClient
-   client.py
-   (you can minizmize the cmd window)

## configuration<a id="sec-1-3" name="sec-1-3"></a>

all configuration is done in the run.cfg file.